Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
ead complete after 0s [id=-]
module.svep[0].module.lambda-concat.data.external.archive_prepare[0]: Reading...
module.svep[0].module.lambda-queryGTF.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-qcNotes.data.external.archive_prepare[0]: Reading...
module.svep[0].module.lambda-pluginClinvar.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-batchSubmit.data.external.archive_prepare[0]: Reading...
module.svep[0].module.lambda-concatStarter.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-queryVCFsubmit.data.external.archive_prepare[0]: Reading...
module.svep[0].module.lambda-pluginGnomadOneKG.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.error-catcher.module.lambda-notifyOnError.data.external.archive_prepare[0]: Reading...
module.svep[0].module.lambda-clearTempAndRegions.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-deleteClinicalWorkflow.data.external.archive_prepare[0]: Reading...
module.svep[0].module.python_modules_layer.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-queryVCF.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.sbeacon.module.lambda-getIndividuals.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getEntryTypes.data.external.archive_prepare[0]: Reading...
module.svep[0].module.lambda-concat.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.security.module.lambda-sendSecurityAlert.data.external.archive_prepare[0]: Reading...
module.svep[0].module.lambda-updateReferenceFiles.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.sbeacon.module.lambda-getFilteringTerms.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-generateReports.data.external.archive_prepare[0]: Reading...
module.svep[0].module.lambda-batchSubmit.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.sbeacon.module.lambda-getInfo.data.external.archive_prepare[0]: Reading...
module.svep[0].module.lambda-queryVCFsubmit.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.sbeacon.module.lambda-updateFiles.data.external.archive_prepare[0]: Reading...
module.error-catcher.module.lambda-notifyOnError.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.sbeacon.module.lambda-data-portal.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getFilteringTerms.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.sbeacon.module.lambda-getMap.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getIndividuals.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-qcNotes.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.sbeacon.module.lambda-getEntryTypes.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-deleteClinicalWorkflow.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.security.module.lambda-sendSecurityAlert.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.sbeacon.module.lambda-performQuery.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getGenomicVariants.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getRuns.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-indexer.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getAnalyses.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getInfo.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.sbeacon.module.lambda-getRuns.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.sbeacon.module.lambda-deidentifyFiles.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getBiosamples.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-generateReports.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.sbeacon.module.lambda-generateCohortVCfs.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getAnalyses.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.sbeacon.module.python_modules_layer.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-updateFiles.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.sbeacon.module.lambda-indexer.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.sbeacon.module.lambda-data-portal.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.sbeacon.module.lambda-getDatasets.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getConfiguration.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-admin.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getMap.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.sbeacon.module.lambda-getProjects.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-performQuery.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.sbeacon.module.lambda-splitQuery.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getGenomicVariants.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.security.data.aws_ses_email_identity.ses_source_email: Reading...
module.security.data.aws_ses_email_identity.ses_source_email: Read complete after 0s [id=no.reply.gaspi.notifications@gmail.com]
module.security.module.lambda-sendSecurityAlert.data.aws_partition.current: Reading...
module.security.module.lambda-sendSecurityAlert.data.aws_partition.current: Read complete after 0s [id=aws]
module.security.module.lambda-sendSecurityAlert.data.aws_region.current: Reading...
module.security.module.lambda-sendSecurityAlert.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.security.module.lambda-sendSecurityAlert.data.aws_caller_identity.current: Reading...
module.security.module.lambda-sendSecurityAlert.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-deidentifyFiles.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.security.data.aws_caller_identity.this: Reading...
module.security.data.aws_caller_identity.this: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-generateCohortVCfs.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.svep[0].module.lambda-pluginClinvar.data.aws_region.current: Reading...
module.svep[0].module.lambda-initQuery.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-formatOutput.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-pluginClinvar.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-initQuery.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-formatOutput.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_region.current: Reading...
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-formatOutput.data.aws_partition.current: Reading...
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-formatOutput.data.aws_region.current: Reading...
module.svep[0].module.lambda-formatOutput.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-formatOutput.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-getResultsURL.data.aws_region.current: Reading...
module.svep[0].module.lambda-getResultsURL.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-pluginClinvar.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-pluginClinvar.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-getConfiguration.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.sbeacon.module.lambda-getBiosamples.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.svep[0].data.aws_iam_policy_document.main-apigateway: Reading...
module.svep[0].module.lambda-clearTempAndRegions.data.aws_partition.current: Reading...
module.sbeacon.module.python_modules_layer.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.svep[0].data.aws_iam_policy_document.main-apigateway: Read complete after 0s [id=2699642182]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_partition.current: Reading...
module.cognito.module.lambda-logEmailDelivery.data.aws_partition.current: Reading...
module.svep[0].module.lambda-pluginClinvar.data.aws_partition.current: Reading...
module.svep[0].module.lambda-pluginConsequence.data.aws_region.current: Reading...
module.svep[0].module.lambda-pluginConsequence.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-pluginClinvar.data.aws_partition.current: Read complete after 0s [id=aws]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_partition.current: Read complete after 0s [id=aws]
module.cognito.module.lambda-logEmailDelivery.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-clearTempAndRegions.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-clearTempAndRegions.data.aws_region.current: Reading...
module.svep[0].module.lambda-concat.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-concatPages.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-clearTempAndRegions.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-batchStarter.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.module.lambda-sendClinicJobEmail.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-concatPages.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-batchStarter.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.module.lambda-sendClinicJobEmail.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-concat.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.cognito.module.lambda-sendClinicJobEmail.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-deleteClinicalWorkflow.data.aws_region.current: Reading...
module.svep[0].module.lambda-concatPages.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.python_modules_layer.data.aws_caller_identity.current: Reading...
module.cognito.module.lambda-sendClinicJobEmail.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-deleteClinicalWorkflow.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-concatPages.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.python_modules_layer.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated_role_policy: Reading...
module.cognito.module.lambda-logEmailDelivery.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-updateReferenceFiles.data.aws_region.current: Reading...
module.cognito.module.lambda-sendClinicJobEmail.data.aws_partition.current: Reading...
module.cognito.module.lambda-sendClinicJobEmail.data.aws_partition.current: Read complete after 0s [id=aws]
module.cognito.module.lambda-logEmailDelivery.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-updateReferenceFiles.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-queryVCFsubmit.data.aws_partition.current: Reading...
module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated_role_policy: Read complete after 0s [id=456311145]
module.svep[0].module.docker_image_pluginConsequence_lambda.data.aws_caller_identity.this: Reading...
data.aws_ecr_authorization_token.token: Reading...
module.svep[0].module.lambda-queryVCFsubmit.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-pluginClinvar.data.aws_iam_policy_document.assume_role[0]: Reading...
data.aws_iam_policy_document.gaspi_backup_assume_role: Reading...
data.aws_iam_policy_document.gaspi_backup_assume_role: Read complete after 0s [id=1497918837]
module.sbeacon.module.lambda-getProjects.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-qcNotes.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-batchStarter.data.aws_partition.current: Reading...
module.svep[0].module.docker_image_pluginConsequence_lambda.data.aws_caller_identity.this: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-pluginClinvar.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.module.lambda-logEmailDelivery.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-queryVCFsubmit.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-batchStarter.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-qcNotes.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.cognito.data.aws_iam_policy_document.gaspi_authenticated_role_policy: Reading...
module.cognito.module.lambda-logEmailDelivery.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.cognito.data.aws_caller_identity.this: Reading...
module.cognito.data.aws_iam_policy_document.gaspi_authenticated_role_policy: Read complete after 0s [id=2449066735]
module.svep[0].module.lambda-getResultsURL.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-queryVCFsubmit.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-queryGTF.data.aws_partition.current: Reading...
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_partition.current: Reading...
module.svep[0].module.lambda-queryGTF.data.aws_partition.current: Read complete after 0s [id=aws]
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_partition.current: Read complete after 0s [id=aws]
module.cognito.data.aws_caller_identity.this: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-getResultsURL.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-initQuery.data.aws_region.current: Reading...
module.svep[0].module.lambda-qcFigures.data.aws_region.current: Reading...
module.svep[0].module.lambda-qcFigures.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-initQuery.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-queryGTF.data.aws_region.current: Reading...
module.svep[0].module.lambda-getResultsURL.data.aws_partition.current: Reading...
data.aws_ecr_authorization_token.token: Read complete after 0s [id=ap-southeast-3]
module.cognito.data.aws_ses_email_identity.ses_source_email: Reading...
module.svep[0].module.lambda-getResultsURL.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-sendJobEmail.data.aws_partition.current: Reading...
module.svep[0].module.lambda-queryGTF.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.docker_image_pluginConsequence_lambda.data.aws_region.current: Reading...
module.cognito.data.aws_iam_policy_document.manager_group_role_policy: Reading...
module.svep[0].module.lambda-batchSubmit.data.aws_region.current: Reading...
module.svep[0].module.docker_image_pluginConsequence_lambda.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-sendJobEmail.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-batchSubmit.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-admin.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.cognito.data.aws_iam_policy_document.manager_group_role_policy: Read complete after 0s [id=2117676676]
module.sbeacon.module.lambda-getProjects.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-pluginGnomad.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-generateReports.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-splitQuery.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.cognito.data.aws_ses_email_identity.ses_source_email: Read complete after 0s [id=no.reply.gaspi.notifications@gmail.com]
module.sbeacon.module.lambda-getProjects.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-pluginGnomad.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-generateReports.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getDatasets.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.python_modules_layer.data.aws_region.current: Reading...
module.svep[0].module.lambda-updateReferenceFiles.data.aws_partition.current: Reading...
module.svep[0].module.lambda-concatPages.data.aws_region.current: Reading...
module.svep[0].module.python_modules_layer.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-sendJobEmail.data.aws_region.current: Reading...
module.svep[0].module.lambda-concatPages.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-getResultsURL.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-updateReferenceFiles.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-clearTempAndRegions.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-pluginGnomad.data.aws_region.current: Reading...
module.svep[0].module.lambda-batchSubmit.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getAnalyses.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-sendJobEmail.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-pluginGnomad.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-pluginGnomad.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getAnalyses.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-batchStarter.data.aws_region.current: Reading...
module.svep[0].module.lambda-getResultsURL.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
data.aws_caller_identity.this: Reading...
module.svep[0].module.lambda-batchSubmit.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-batchStarter.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-clearTempAndRegions.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-batchStarter.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-concat.data.aws_partition.current: Reading...
module.svep[0].module.python_modules_layer.data.aws_partition.current: Reading...
module.svep[0].module.lambda-queryGTF.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-qcFigures.data.aws_partition.current: Reading...
module.svep[0].module.lambda-concat.data.aws_partition.current: Read complete after 0s [id=aws]
aws_backup_vault.gaspi_backup_vault: Refreshing state... [id=gaspi_backup_vault]
module.svep[0].module.python_modules_layer.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-sendJobEmail.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-createPages.data.aws_region.current: Reading...
module.svep[0].module.lambda-qcFigures.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-qcFigures.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-pluginGnomad.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
data.aws_caller_identity.this: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-initQuery.data.aws_partition.current: Reading...
module.svep[0].module.lambda-pluginConsequence.data.aws_partition.current: Reading...
module.svep[0].module.lambda-queryGTF.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-createPages.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-pluginConsequence.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-batchStarter.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-sendJobEmail.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-concat.data.aws_region.current: Reading...
module.svep[0].module.lambda-pluginConsequence.data.aws_partition.current: Read complete after 0s [id=aws]
module.cognito.module.lambda-logEmailDelivery.data.aws_region.current: Reading...
module.svep[0].module.lambda-initQuery.data.aws_partition.current: Read complete after 0s [id=aws]
module.cognito.module.lambda-logEmailDelivery.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-concat.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-pluginConsequence.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-qcFigures.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-getEntryTypes.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getIndividuals.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-performQuery.data.aws_region.current: Reading...
module.sbeacon.module.lambda-indexer.data.aws_region.current: Reading...
module.sbeacon.module.lambda-admin.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getIndividuals.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.data.aws_iam_policy_document.main-apigateway: Reading...
module.sbeacon.module.lambda-getEntryTypes.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-indexer.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-performQuery.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-data-portal.data.aws_region.current: Reading...
module.sbeacon.module.lambda-data-portal.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-updateReferenceFiles.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-batchSubmit.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-admin.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.data.aws_iam_policy_document.main-apigateway: Read complete after 0s [id=2699642182]
module.cognito.module.lambda-sendClinicJobEmail.data.aws_region.current: Reading...
module.svep[0].module.lambda-batchSubmit.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getProjects.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getBiosamples.data.aws_partition.current: Reading...
module.cognito.module.lambda-sendClinicJobEmail.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getBiosamples.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getProjects.data.aws_partition.current: Read complete after 0s [id=aws]
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-updateReferenceFiles.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-qcNotes.data.aws_partition.current: Reading...
module.cognito.module.lambda-sendRegistrationEmail.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.cognito.data.aws_iam_policy_document.admin_group_role_policy: Reading...
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_caller_identity.current: Reading...
module.cognito.module.lambda-sendRegistrationEmail.data.aws_region.current: Reading...
module.svep[0].module.lambda-qcNotes.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-concatStarter.data.aws_region.current: Reading...
module.cognito.data.aws_iam_policy_document.admin_group_role_policy: Read complete after 0s [id=1269268040]
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.data.aws_caller_identity.this: Reading...
module.svep[0].module.lambda-concatStarter.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getRuns.data.aws_caller_identity.current: Reading...
module.sbeacon.data.aws_ecr_authorization_token.token: Reading...
module.sbeacon.data.aws_caller_identity.this: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-getMap.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getEntryTypes.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getRuns.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-getEntryTypes.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-qcNotes.data.aws_region.current: Reading...
module.svep[0].module.lambda-queryVCF.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getMap.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-qcNotes.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-submitDataset.data.aws_partition.current: Reading...
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-queryVCF.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-queryVCFsubmit.data.aws_region.current: Reading...
module.sbeacon.data.aws_ecr_authorization_token.token: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-queryVCFsubmit.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-deleteClinicalWorkflow.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-submitDataset.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-splitQuery.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-splitQuery.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_partition.current: Reading...
module.sbeacon.module.python_modules_layer.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-deleteClinicalWorkflow.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].data.aws_iam_policy_document.ec2_assume_role_policy: Reading...
module.sbeacon.module.python_modules_layer.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.aws_s3_bucket.metadata-bucket: Refreshing state... [id=gaspi-metadata-20250725085316769800000002]
module.svep[0].data.aws_iam_policy_document.ec2_assume_role_policy: Read complete after 0s [id=2851119427]
module.sbeacon.module.lambda-updateFiles.data.aws_caller_identity.current: Reading...
module.error-catcher.module.lambda-notifyOnError.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getRuns.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-updateFiles.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getAnalyses.data.aws_partition.current: Reading...
module.error-catcher.module.lambda-notifyOnError.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getRuns.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getAnalyses.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-updateFiles.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-getInfo.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getProjects.data.aws_region.current: Reading...
module.sbeacon.module.lambda-updateFiles.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getRuns.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getRuns.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-generateReports.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getInfo.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getProjects.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-submitDataset.data.aws_caller_identity.current: Reading...
module.svep[0].data.aws_caller_identity.this: Reading...
module.svep[0].module.lambda-initQuery.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-generateReports.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-initQuery.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].data.aws_caller_identity.this: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-submitDataset.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-splitQuery.data.aws_region.current: Reading...
module.error-catcher.data.aws_caller_identity.this: Reading...
module.sbeacon.module.lambda-splitQuery.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.error-catcher.module.lambda-notifyOnError.data.aws_caller_identity.current: Reading...
module.error-catcher.module.lambda-notifyOnError.data.aws_partition.current: Reading...
module.sbeacon.data.aws_iam_policy_document.sagemaker_jupyter_instance_assume_role_policy: Reading...
module.error-catcher.data.aws_default_tags.this: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-submitDataset: Reading...
module.error-catcher.data.aws_default_tags.this: Read complete after 0s [id=aws]
module.sbeacon.data.aws_iam_policy_document.sagemaker_jupyter_instance_assume_role_policy: Read complete after 0s [id=1147345228]
module.sbeacon.module.lambda-data-portal.data.aws_partition.current: Reading...
module.error-catcher.module.lambda-notifyOnError.data.aws_partition.current: Read complete after 0s [id=aws]
module.error-catcher.data.aws_caller_identity.this: Read complete after 0s [id=209479276142]
module.sbeacon.data.aws_iam_policy_document.lambda-submitDataset: Read complete after 0s [id=4273650825]
module.error-catcher.module.lambda-notifyOnError.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-data-portal.data.aws_partition.current: Read complete after 1s [id=aws]
module.sbeacon.module.lambda-getInfo.data.aws_partition.current: Reading...
module.error-catcher.data.aws_region.current: Reading...
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getInfo.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-createPages.data.aws_partition.current: Reading...
module.svep[0].module.lambda-createPages.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-queryVCF.data.aws_partition.current: Reading...
module.sbeacon.data.aws_iam_policy_document.glue: Reading...
module.error-catcher.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-splitQuery.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-queryVCF.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_partition.current: Reading...
module.sbeacon.data.aws_iam_policy_document.glue: Read complete after 0s [id=2681768870]
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getFilteringTerms.data.aws_region.current: Reading...
module.svep[0].module.docker_image_qcFigures_lambda.data.aws_region.current: Reading...
module.svep[0].module.docker_image_qcFigures_lambda.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getInfo.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-splitQuery.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.data.aws_iam_policy_document.ec2_assume_role_policy: Reading...
module.sbeacon.module.lambda-generateReports.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getFilteringTerms.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-deleteClinicalWorkflow.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-generateReports.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getIndividuals.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getDatasets.data.aws_caller_identity.current: Reading...
module.svep[0].module.docker_image_qcFigures_lambda.data.aws_caller_identity.this: Reading...
module.sbeacon.module.lambda-getBiosamples.data.aws_region.current: Reading...
module.sbeacon.data.aws_iam_policy_document.ec2_assume_role_policy: Read complete after 0s [id=2851119427]
module.svep[0].module.lambda-deleteClinicalWorkflow.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-getBiosamples.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getInfo.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-performQuery.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-indexer.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getMap.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getIndividuals.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-getMap.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-createPages.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-queryVCF.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-updateFiles.data.aws_region.current: Reading...
module.svep[0].module.docker_image_qcFigures_lambda.data.aws_caller_identity.this: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-getDatasets.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-indexer.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-updateFiles.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-createPages.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-admin.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getDatasets.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getDatasets.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getDatasets.data.aws_region.current: Reading...
module.sbeacon.module.lambda-admin.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-queryVCF.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.python_modules_layer.data.aws_partition.current: Reading...
module.sbeacon.module.python_modules_layer.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-performQuery.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-getDatasets.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-concatStarter.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-admin.data.aws_region.current: Reading...
module.sbeacon.module.lambda-deidentifyFiles.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getConfiguration.data.aws_region.current: Reading...
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_region.current: Reading...
module.sbeacon.module.lambda-admin.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-concatStarter.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-deidentifyFiles.data.aws_region.current: Reading...
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getConfiguration.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-deidentifyFiles.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-deidentifyFiles.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getConfiguration.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-deidentifyFiles.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getConfiguration.data.aws_caller_identity.current: Reading...
module.sbeacon.module.python_modules_layer.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getAnalyses.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getConfiguration.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getGenomicVariants.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getAnalyses.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-indexer.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getGenomicVariants.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-deidentifyFiles.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.python_modules_layer.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getGenomicVariants.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-data-portal.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getFilteringTerms.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getMap.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getConfiguration.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-indexer.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getGenomicVariants.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-performQuery.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getGenomicVariants.data.aws_caller_identity.current: Reading...
module.sbeacon.module.docker_image_submitDataset_lambda.data.aws_caller_identity.this: Reading...
module.sbeacon.module.lambda-performQuery.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-submitDataset.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getFilteringTerms.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.docker_image_submitDataset_lambda.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getMap.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getEntryTypes.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-submitDataset.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getFilteringTerms.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getGenomicVariants.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.docker_image_submitDataset_lambda.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_region.current: Reading...
module.svep[0].module.lambda-concatStarter.data.aws_partition.current: Reading...
module.sbeacon.data.aws_iam_policy.AWSGlueServiceRole: Reading...
module.sbeacon.module.lambda-data-portal.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.docker_image_submitDataset_lambda.data.aws_caller_identity.this: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-concatStarter.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.data.aws_iam_policy_document.lambda-performQuery: Reading...
module.sbeacon.module.lambda-getEntryTypes.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.module.lambda-getFilteringTerms.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.sbeacon.data.aws_iam_policy_document.lambda-performQuery: Read complete after 0s [id=3620005588]
module.svep[0].module.lambda-pluginGnomad.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getBiosamples.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getIndividuals.data.aws_region.current: Reading...
module.svep[0].module.lambda-pluginGnomad.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-concatPages.data.aws_partition.current: Reading...
module.svep[0].module.lambda-concatPages.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getIndividuals.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getBiosamples.data.aws_caller_identity.current: Read complete after 0s [id=209479276142]
module.webgui.data.aws_cloudfront_cache_policy.bui-s3-distribution-cache-policy: Reading...
module.gaspifs.data.aws_caller_identity.this: Reading...
module.gaspifs.data.aws_caller_identity.this: Read complete after 0s [id=209479276142]
module.svep[0].module.lambda-formatOutput.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-formatOutput.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.module.lambda-sendRegistrationEmail.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-createPages.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-createPages.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.security.data.aws_iam_policy_document.lambda-sendSecurityAlert: Reading...
module.security.data.aws_iam_policy_document.lambda-sendSecurityAlert: Read complete after 0s [id=3562341625]
module.svep[0].module.lambda-concatStarter.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-concatStarter.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-queryVCF.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-queryVCF.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-qcFigures.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-qcFigures.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.data.aws_iam_policy_document.extra-glue-policy-document: Reading...
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-queryGTF.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.data.aws_iam_policy_document.extra-glue-policy-document: Read complete after 0s [id=2464110242]
module.svep[0].module.lambda-queryGTF.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-pluginConsequence.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-pluginConsequence.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.data.aws_iam_policy.AWSGlueServiceRole: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole]
module.svep[0].module.lambda-updateReferenceFiles.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-updateReferenceFiles.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-concat.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-concat.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.webgui.data.aws_cloudfront_cache_policy.bui-s3-distribution-cache-policy: Read complete after 1s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.svep[0].module.lambda-clearTempAndRegions.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-clearTempAndRegions.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-batchSubmit.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-qcNotes.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-batchSubmit.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-qcNotes.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.error-catcher.module.lambda-notifyOnError.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-queryVCFsubmit.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-queryVCFsubmit.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-deleteClinicalWorkflow.data.aws_iam_policy_document.assume_role[0]: Reading...
module.error-catcher.module.lambda-notifyOnError.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-deleteClinicalWorkflow.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.security.module.lambda-sendSecurityAlert.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getIndividuals.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getIndividuals.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.security.module.lambda-sendSecurityAlert.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-submitDataset.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-submitDataset.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getEntryTypes.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getFilteringTerms.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getEntryTypes.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getFilteringTerms.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-generateReports.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-generateReports.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-data-portal.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-updateFiles.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-data-portal.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-updateFiles.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getMap.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getMap.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getInfo.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getInfo.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-performQuery.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-performQuery.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getConfiguration.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getRuns.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getGenomicVariants.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getRuns.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getConfiguration.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getGenomicVariants.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getAnalyses.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-indexer.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getAnalyses.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-indexer.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getBiosamples.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-deidentifyFiles.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-admin.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-admin.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getBiosamples.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-deidentifyFiles.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getDatasets.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getProjects.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getDatasets.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getProjects.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-splitQuery.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-splitQuery.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # aws_backup_plan.gaspi_backup_plan will be created
  + resource "aws_backup_plan" "gaspi_backup_plan" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "gaspi_backup_plan"
      + region   = "ap-southeast-3"
      + tags     = {
          + "Environment" = "STAGING"
          + "Owner"       = "GXC"
        }
      + tags_all = {
          + "Environment" = "STAGING"
          + "Owner"       = "GXC"
        }
      + version  = (known after apply)

      + rule {
          + completion_window                            = 180
          + enable_continuous_backup                     = false
          + rule_name                                    = "weekly"
          + schedule                                     = "cron(0 20 ? * SUN *)"
          + schedule_expression_timezone                 = "Etc/UTC"
          + start_window                                 = 60
          + target_vault_name                            = "gaspi_backup_vault"
            # (1 unchanged attribute hidden)

          + lifecycle {
              + delete_after                              = 30
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
      + rule {
          + completion_window                            = 180
          + enable_continuous_backup                     = false
          + rule_name                                    = "yearly"
          + schedule                                     = "cron(0 22 1 1 ? *)"
          + schedule_expression_timezone                 = "Etc/UTC"
          + start_window                                 = 60
          + target_vault_name                            = "gaspi_backup_vault"
            # (1 unchanged attribute hidden)

          + lifecycle {
              + delete_after                              = 3650
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
      + rule {
          + completion_window                            = 180
          + enable_continuous_backup                     = false
          + rule_name                                    = "monthly"
          + schedule                                     = "cron(0 21 1 * ? *)"
          + schedule_expression_timezone                 = "Etc/UTC"
          + start_window                                 = 60
          + target_vault_name                            = "gaspi_backup_vault"
            # (1 unchanged attribute hidden)

          + lifecycle {
              + delete_after                              = 365
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
      + rule {
          + completion_window                            = 180
          + enable_continuous_backup                     = false
          + rule_name                                    = "daily"
          + schedule                                     = "cron(0 19 * * ? *)"
          + schedule_expression_timezone                 = "Etc/UTC"
          + start_window                                 = 60
          + target_vault_name                            = "gaspi_backup_vault"
            # (1 unchanged attribute hidden)

          + lifecycle {
              + delete_after                              = 7
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
    }

  # aws_backup_selection.gaspi_backup_selection will be created
  + resource "aws_backup_selection" "gaspi_backup_selection" {
      + iam_role_arn  = (known after apply)
      + id            = (known after apply)
      + name          = "gaspi_backup_resource_selection"
      + not_resources = (known after apply)
      + plan_id       = (known after apply)
      + region        = "ap-southeast-3"

      + condition (known after apply)

      + selection_tag {
          + key   = "backup"
          + type  = "STRINGEQUALS"
          + value = "true"
        }
    }

  # aws_iam_role.gaspi_backup_role will be created
  + resource "aws_iam_role" "gaspi_backup_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "backup.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi_backup_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.gaspi_backup_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_backup_role_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForBackup"
      + role       = "gaspi_backup_role"
    }

  # aws_iam_role_policy_attachment.gaspi_backup_s3_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_backup_s3_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSBackupServiceRolePolicyForS3Backup"
      + role       = "gaspi_backup_role"
    }

  # aws_iam_role_policy_attachment.gaspi_restore_s3_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_restore_s3_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSBackupServiceRolePolicyForS3Restore"
      + role       = "gaspi_backup_role"
    }

  # module.cognito.data.aws_iam_policy_document.admin_group_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "admin_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_authenticated will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "gaspi_authenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "gaspi_unauthenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "unauthenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
      
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.